/**
 * @description:java程序设计概述
 * @author:萧易扬
 * @time: 2021/5/14 22:10
 */
public class Demo01 {
    /**
     * 1.1   java设计平台(即 java)
     *          java是一种功能齐全的语言，是一个高质量的执行环境，还提供了一个庞大的库
     *
     *
     * 1.2   Java的特性
     *          (1)    简单性
     *
     *          (2)    面向对象
     *                      eg:
     *                      木匠           -->       程序员
     *                      面向对象        -->      所制作的椅子
     *                      非面向对象       -->     所用的工具
     *
     *
     *          (3)     分布式
     *                      java 有个丰富的例程库，用于处理像HTTP和FTP这类的tcp/ip协定
     *
     *          (4)     健壮性
     *                      与c++不同，java采用的指针模型可以消除重写内存和损坏数据的可能性
     *
     *          (5)     安全性
     *                      java适用于网络/分布式环境。java今天构建防病毒、防篡改的系统，包括
     *                          (1  运行时堆栈溢出，防止蠕虫和病毒常用的攻击方式
     *                          (2  破坏战局的进程空间之外的内存
     *                          (3  未经授权读写的文件
     *
     *          (6)     体系结构中立
     *
     *          (7)     可移植性
     *
     *          (8)     解释性
     *
     *          (9)     高性能
     *
     *          (10)    多线程
     *
     *          (11)    多态性
     *
     * 1.3  java applet 与 Internet
     *
     * 1.4  java发展简史
     *
     *
     *
     *
     */
}
